zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxMcds_regdef.h
/** \brief MCDS object */
typedef volatile struct _Ifx_MCDS
{
       Ifx_MCDS_CLC                        CLC;                    /**< \brief 0, Clock Control Register*/
       Ifx_MCDS_OCS                        OCS;                    /**< \brief 4, OCDS Control and Status*/
       Ifx_MCDS_ID                         ID;                     /**< \brief 8, Module Identification Register*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
       Ifx_MCDS_CT                         CT;                     /**< \brief 10, MCDS Control Register*/
       Ifx_MCDS_MUX                        MUX;                    /**< \brief 14, MCDS Signal Source Control*/
       Ifx_MCDS_SESSIDL                    SESSIDL;                /**< \brief 18, Session ID Low Register*/
       Ifx_MCDS_SESSIDH                    SESSIDH;                /**< \brief 1C, Session ID High Register*/
       Ifx_MCDS_MUX_TC_RC                  MUX_TC_RC;              /**< \brief 20, MCDS_TC Signal Source Control*/
       Ifx_UReg_8Bit                       reserved_24[212];       /**< \brief 24, \internal Reserved */
       Ifx_MCDS_ACCEN1                     ACCEN1;                 /**< \brief F8, Access Enable Register 1*/
       Ifx_MCDS_ACCEN0                     ACCEN0;                 /**< \brief FC, Access Enable Register 0*/
       Ifx_UReg_8Bit                       reserved_100[256];      /**< \brief 100, \internal Reserved */
       Ifx_MCDS_FIFONOW                    FIFONOW;                /**< \brief 200, Trace Buffer Write Pointer*/
       Ifx_MCDS_FIFOBOT                    FIFOBOT;                /**< \brief 204, Trace Buffer Bottom Register*/
       Ifx_MCDS_FIFOPRE                    FIFOPRE;                /**< \brief 208, Trace Buffer PRE/POST Register*/
       Ifx_MCDS_FIFOTOP                    FIFOTOP;                /**< \brief 20C, Trace Buffer Top Register*/
       Ifx_MCDS_FIFOCTL                    FIFOCTL;                /**< \brief 210, Trace Buffer Control Register*/
       Ifx_MCDS_FIFOWARN                   FIFOWARN[2];            /**< \brief 214, Trace Buffer Comparator Register*/
       Ifx_MCDS_FIFOOVRCNT                 FIFOOVRCNT;             /**< \brief 21C, FIFO Overflow Counter Register*/
       Ifx_MCDS_FIFONTNOW                  FIFONTNOW;              /**< \brief 220, Trace Buffer Captured Write Pointer*/
       Ifx_UReg_8Bit                       reserved_224[476];      /**< \brief 224, \internal Reserved */
       Ifx_MCDS_TSUREFCNT                  TSUREFCNT;              /**< \brief 400, Clock Counter Register*/
       Ifx_MCDS_TSUPRSCL                   TSUPRSCL;               /**< \brief 404, Clock Prescaler Register*/
       Ifx_MCDS_TSUEMUCNT                  TSUEMUCNT;              /**< \brief 408, Clock Counter Register*/
       Ifx_UReg_8Bit                       reserved_40C[1012];     /**< \brief 40C, \internal Reserved */
       Ifx_MCDS_MCXEVT                     MCXEVT[24];             /**< \brief 800, Event Definition Register ${x}*/
       Ifx_UReg_8Bit                       reserved_860[32];       /**< \brief 860, \internal Reserved */
       Ifx_MCDS_MCXACT                     MCXACT[81];             /**< \brief 880, Action Definition Register ${x}*/
       Ifx_UReg_8Bit                       reserved_9C4[60];       /**< \brief 9C4, \internal Reserved */
       Ifx_MCDS_MCX                        MCX[32];                /**< \brief A00, */
       Ifx_MCDS_MCXPERFCFG                 MCXPERFCFG;             /**< \brief C00, Performance Counter Configuration Register*/
       Ifx_UReg_8Bit                       reserved_C04[5116];     /**< \brief C04, \internal Reserved */
       Ifx_MCDS_TCXDCSTS                   TCXDCSTS;               /**< \brief 2000, Debug Status Register*/
       Ifx_MCDS_TCXCID                     TCXCID;                 /**< \brief 2004, Current Process ID*/
       Ifx_MCDS_TCXCIP                     TCXCIP;                 /**< \brief 2008, Current Instruction Pointer*/
       Ifx_MCDS_TCXCFT                     TCXCFT;                 /**< \brief 200C, Compact Function Trace Register*/
       Ifx_UReg_8Bit                       reserved_2010[496];     /**< \brief 2010, \internal Reserved */
       Ifx_MCDS_TCXPALLUTD                 TCXPALLUTD;             /**< \brief 2200, Lookup Table Data Register*/
       Ifx_MCDS_TCXPALLUTA                 TCXPALLUTA;             /**< \brief 2204, Lookup Table Address Register*/
       Ifx_UReg_8Bit                       reserved_2208[8];       /**< \brief 2208, \internal Reserved */
       Ifx_MCDS_TCXPAL                     TCXPAL[4];              /**< \brief 2210, */
       Ifx_UReg_8Bit                       reserved_2250[432];     /**< \brief 2250, \internal Reserved */
       Ifx_MCDS_TCXEA                      TCXEA[8];               /**< \brief 2400, */
       Ifx_MCDS_TCXWD                      TCXWD[4];               /**< \brief 2480, */
       Ifx_MCDS_TCXAC                      TCXAC[4];               /**< \brief 2500, */
       Ifx_UReg_8Bit                       reserved_2540[64];      /**< \brief 2540, \internal Reserved */
       Ifx_MCDS_TCXDTUFLV                  TCXDTUFLV;              /**< \brief 2580, DTU FIFOs Fill Level*/
       Ifx_UReg_8Bit                       reserved_2584[636];     /**< \brief 2584, \internal Reserved */
       Ifx_MCDS_TCXEVT                     TCXEVT[16];             /**< \brief 2800, Event Definition Register ${x}*/
       Ifx_UReg_8Bit                       reserved_2840[64];      /**< \brief 2840, \internal Reserved */
       Ifx_MCDS_TCXACT                     TCXACT[24];             /**< \brief 2880, Action Definition Register ${x}*/
       Ifx_UReg_8Bit                       reserved_28E0[800];     /**< \brief 28E0, \internal Reserved */
       Ifx_MCDS_TCXID                      TCXID[2];               /**< \brief 2C00, */
       Ifx_UReg_8Bit                       reserved_2C20[992];     /**< \brief 2C20, \internal Reserved */
       Ifx_MCDS_TCXIP                      TCXIP[6];               /**< \brief 3000, */
       Ifx_UReg_8Bit                       reserved_3060[4000];    /**< \brief 3060, \internal Reserved */
       Ifx_MCDS_TCYDCSTS                   TCYDCSTS;               /**< \brief 4000, Debug Status Register*/
       Ifx_MCDS_TCYCID                     TCYCID;                 /**< \brief 4004, Current Process ID*/
       Ifx_MCDS_TCYCIP                     TCYCIP;                 /**< \brief 4008, Current Instruction Pointer*/
       Ifx_MCDS_TCYCFT                     TCYCFT;                 /**< \brief 400C, Compact Function Trace Register*/
       Ifx_UReg_8Bit                       reserved_4010[496];     /**< \brief 4010, \internal Reserved */
       Ifx_MCDS_TCYPALLUTD                 TCYPALLUTD;             /**< \brief 4200, Lookup Table Data Register*/
       Ifx_MCDS_TCYPALLUTA                 TCYPALLUTA;             /**< \brief 4204, Lookup Table Address Register*/
       Ifx_UReg_8Bit                       reserved_4208[8];       /**< \brief 4208, \internal Reserved */
       Ifx_MCDS_TCYPAL                     TCYPAL[4];              /**< \brief 4210, */
       Ifx_UReg_8Bit                       reserved_4250[432];     /**< \brief 4250, \internal Reserved */
       Ifx_MCDS_TCYEA                      TCYEA[8];               /**< \brief 4400, */
       Ifx_MCDS_TCYWD                      TCYWD[4];               /**< \brief 4480, */
       Ifx_MCDS_TCYAC                      TCYAC[4];               /**< \brief 4500, */
       Ifx_UReg_8Bit                       reserved_4540[64];      /**< \brief 4540, \internal Reserved */
       Ifx_MCDS_TCYDTUFLV                  TCYDTUFLV;              /**< \brief 4580, DTU FIFOs Fill Level*/
       Ifx_UReg_8Bit                       reserved_4584[636];     /**< \brief 4584, \internal Reserved */
       Ifx_MCDS_TCYEVT                     TCYEVT[16];             /**< \brief 4800, Event Definition Register ${x}*/
       Ifx_UReg_8Bit                       reserved_4840[64];      /**< \brief 4840, \internal Reserved */
       Ifx_MCDS_TCYACT                     TCYACT[24];             /**< \brief 4880, Action Definition Register ${x}*/
       Ifx_UReg_8Bit                       reserved_48E0[800];     /**< \brief 48E0, \internal Reserved */
       Ifx_MCDS_TCYID                      TCYID[2];               /**< \brief 4C00, */
       Ifx_UReg_8Bit                       reserved_4C20[992];     /**< \brief 4C20, \internal Reserved */
       Ifx_MCDS_TCYIP                      TCYIP[6];               /**< \brief 5000, */
       Ifx_UReg_8Bit                       reserved_5060[4000];    /**< \brief 5060, \internal Reserved */
       Ifx_MCDS_SPBDCSTS                   SPBDCSTS;               /**< \brief 6000, Debug Status Register*/
       Ifx_UReg_8Bit                       reserved_6004[1020];    /**< \brief 6004, \internal Reserved */
       Ifx_MCDS_SPBEA                      SPBEA[4];               /**< \brief 6400, */
       Ifx_UReg_8Bit                       reserved_6440[64];      /**< \brief 6440, \internal Reserved */
       Ifx_MCDS_SPBWD                      SPBWD[4];               /**< \brief 6480, */
       Ifx_UReg_8Bit                       reserved_64C0[64];      /**< \brief 64C0, \internal Reserved */
       Ifx_MCDS_SPBAC                      SPBAC[4];               /**< \brief 6500, */
       Ifx_UReg_8Bit                       reserved_6540[704];     /**< \brief 6540, \internal Reserved */
       Ifx_MCDS_SPBEVT                     SPBEVT[16];             /**< \brief 6800, Event Definition Register ${x}*/
       Ifx_UReg_8Bit                       reserved_6840[64];      /**< \brief 6840, \internal Reserved */
       Ifx_MCDS_SPBACT                     SPBACT[15];             /**< \brief 6880, Action Definition Register ${x}*/
       Ifx_UReg_8Bit                       reserved_68BC[1860];    /**< \brief 68BC, \internal Reserved */
       Ifx_MCDS_SRIDCSTS                   SRIDCSTS;               /**< \brief 7000, Debug Status Register*/
       Ifx_UReg_8Bit                       reserved_7004[508];     /**< \brief 7004, \internal Reserved */
       Ifx_MCDS_SRI1BALLUTD                SRI1BALLUTD;            /**< \brief 7200, Lookup Table Data Register*/
       Ifx_MCDS_SRI1BALLUTA                SRI1BALLUTA;            /**< \brief 7204, Lookup Table Address Register*/
       Ifx_UReg_8Bit                       reserved_7208[8];       /**< \brief 7208, \internal Reserved */
       Ifx_MCDS_SRI1BAL                    SRI1BAL[4];             /**< \brief 7210, */
       Ifx_UReg_8Bit                       reserved_7250[176];     /**< \brief 7250, \internal Reserved */
       Ifx_MCDS_SRI2BALLUTD                SRI2BALLUTD;            /**< \brief 7300, Lookup Table Data Register*/
       Ifx_MCDS_SRI2BALLUTA                SRI2BALLUTA;            /**< \brief 7304, Lookup Table Address Register*/
       Ifx_UReg_8Bit                       reserved_7308[8];       /**< \brief 7308, \internal Reserved */
       Ifx_MCDS_SRI2BAL                    SRI2BAL[4];             /**< \brief 7310, */
       Ifx_UReg_8Bit                       reserved_7350[176];     /**< \brief 7350, \internal Reserved */
       Ifx_MCDS_SRI1EA                     SRI1EA[4];              /**< \brief 7400, */
       Ifx_UReg_8Bit                       reserved_7440[64];      /**< \brief 7440, \internal Reserved */
       Ifx_MCDS_SRI1WD                     SRI1WD[4];              /**< \brief 7480, */
       Ifx_MCDS_SRI1AC                     SRI1AC[4];              /**< \brief 7500, */
       Ifx_UReg_8Bit                       reserved_7540[64];      /**< \brief 7540, \internal Reserved */
       Ifx_MCDS_SRI1DTUFLV                 SRI1DTUFLV;             /**< \brief 7580, DTU FIFOs Fill Level*/
       Ifx_UReg_8Bit                       reserved_7584[124];     /**< \brief 7584, \internal Reserved */
       Ifx_MCDS_SRI2EA                     SRI2EA[4];              /**< \brief 7600, */
       Ifx_UReg_8Bit                       reserved_7640[64];      /**< \brief 7640, \internal Reserved */
       Ifx_MCDS_SRI2WD                     SRI2WD[4];              /**< \brief 7680, */
       Ifx_MCDS_SRI2AC                     SRI2AC[4];              /**< \brief 7700, */
       Ifx_UReg_8Bit                       reserved_7740[64];      /**< \brief 7740, \internal Reserved */
       Ifx_MCDS_SRI2DTUFLV                 SRI2DTUFLV;             /**< \brief 7780, DTU FIFOs Fill Level*/
       Ifx_UReg_8Bit                       reserved_7784[124];     /**< \brief 7784, \internal Reserved */
       Ifx_MCDS_SRIEVT                     SRIEVT[16];             /**< \brief 7800, Event Definition Register ${x}*/
       Ifx_UReg_8Bit                       reserved_7840[64];      /**< \brief 7840, \internal Reserved */
       Ifx_MCDS_SRIACT                     SRIACT[27];             /**< \brief 7880, Action Definition Register ${x}*/
       Ifx_UReg_8Bit                       reserved_78EC[1812];    /**< \brief 78EC, \internal Reserved */
       Ifx_MCDS_TCZDCSTS                   TCZDCSTS;               /**< \brief 8000, Debug Status Register*/
       Ifx_MCDS_TCZCID                     TCZCID;                 /**< \brief 8004, Current Process ID*/
       Ifx_MCDS_TCZCIP                     TCZCIP;                 /**< \brief 8008, Current Instruction Pointer*/
       Ifx_MCDS_TCZCFT                     TCZCFT;                 /**< \brief 800C, Compact Function Trace Register*/
       Ifx_UReg_8Bit                       reserved_8010[496];     /**< \brief 8010, \internal Reserved */
       Ifx_MCDS_TCZPALLUTD                 TCZPALLUTD;             /**< \brief 8200, Lookup Table Data Register*/
       Ifx_MCDS_TCZPALLUTA                 TCZPALLUTA;             /**< \brief 8204, Lookup Table Address Register*/
       Ifx_UReg_8Bit                       reserved_8208[8];       /**< \brief 8208, \internal Reserved */
       Ifx_MCDS_TCZPAL                     TCZPAL[4];              /**< \brief 8210, */
       Ifx_UReg_8Bit                       reserved_8250[432];     /**< \brief 8250, \internal Reserved */
       Ifx_MCDS_TCZEA                      TCZEA[8];               /**< \brief 8400, */
       Ifx_MCDS_TCZWD                      TCZWD[4];               /**< \brief 8480, */
       Ifx_MCDS_TCZAC                      TCZAC[4];               /**< \brief 8500, */
       Ifx_UReg_8Bit                       reserved_8540[64];      /**< \brief 8540, \internal Reserved */
       Ifx_MCDS_TCZDTUFLV                  TCZDTUFLV;              /**< \brief 8580, DTU FIFOs Fill Level*/
       Ifx_UReg_8Bit                       reserved_8584[636];     /**< \brief 8584, \internal Reserved */
       Ifx_MCDS_TCZEVT                     TCZEVT[16];             /**< \brief 8800, Event Definition Register ${x}*/
       Ifx_UReg_8Bit                       reserved_8840[64];      /**< \brief 8840, \internal Reserved */
       Ifx_MCDS_TCZACT                     TCZACT[24];             /**< \brief 8880, Action Definition Register ${x}*/
       Ifx_UReg_8Bit                       reserved_88E0[800];     /**< \brief 88E0, \internal Reserved */
       Ifx_MCDS_TCZID                      TCZID[2];               /**< \brief 8C00, */
       Ifx_UReg_8Bit                       reserved_8C20[992];     /**< \brief 8C20, \internal Reserved */
       Ifx_MCDS_TCZIP                      TCZIP[6];               /**< \brief 9000, */
       Ifx_UReg_8Bit                       reserved_9060[28576];    /**< \brief 9060, \internal Reserved */
} Ifx_MCDS;

/** \}  */
/******************************************************************************/
/** \}  */


/******************************************************************************/

/******************************************************************************/

#endif /* IFXMCDS_REGDEF_H */
